///আগামীকাল ২১শে ফেব্রুয়ারি হওয়ায় এই কোডের সকল কমেন্ট বাংলায় টাইপ করবো।।

///সমস্যার বর্ণনাঃ
///ধরা যাক, আমার কাছে দুইটি অ্যারে আছে।। ক এবং  খ।
///ধরি, তাদের সাইজ ৬। ক [১,২,৩,১০,২০,৩০], খ[৩,৪,৫,২০,৩০,৪০]
///এখন আমাদের কাজ হলো, এই দুই অ্যারেকে সমান বানানো, কিন্তু সেখানে কিছু শর্ত আছে।। যেই এলিমেন্টকে রিপ্লেস করবো, তার
///ডিজিট সংখ্যার সমান হবে রিপ্লেসকৃত সংখ্যা।। অর্থাৎ, ক অ্যারেতে যদি ১০ কে রিপ্লেস করি, তাহলে রিপ্লেসকৃত সংখ্যাটি হবে ২, কারন
///১০ এর ডিজিট সংখ্যা ২।। এভাবে করে সম্পূর্ণ দুটি অ্যারেকে সমান বানাতে হবে।। আমাদের উত্তর হবে কতোগুলো অপারেশনে আমরা
///দুটো অ্যাারেকে সমান বানাতে পারবো।।

///আচ্ছা। এবার দেখা যাক, কিভাবে সমাধান করা যায়। আমরা দুটি প্রায়োরিটি কিউ নিবো এবং দুটোতে এই এলিমেন্টগুলো পুশ করবো প্রথমে
///এরপর তুলনা করে দেখবো দুটোর টপ।। প্রায়োরিটি কিউতে টপ এলিমেন্ট হলো ম্যাক্স এলিমেন্ট।। ধরি, ক আর খ এর প্রায়োরিটি কিউ
///তুলনা হবে ক থেকে ৩০ আর খ থেকে ৪০ এর।। এখানে বড় কিন্তু খ এর ৪০।  ৪০ কে  আমরা পপ করে ২ পুশ করে দিবো খ তে।
///সুতরাং দাঁড়ায় => খ[২,৩,৪,৫,২০,৩০]।। এবার ক আর খ এর টপ এলিমেন্ট কিন্তু সমান।।কাজেই, দুইটাই দুই কিউ থেকে পপ হয়ে যাবে।
///সুতরাং দাঁড়ায় => ক[১,২,৩,১০,২০] এবং খ[২,৩,৪,৫,২০]। একইভাবে কিন্তু ২০ ও পপ হয়ে যাবে দুই অ্যাারে থেকেই
///এরপর দেখা যাচ্ছে ক থেকে ১০ আর খ থেকে ৫ এর তুলনা। ১০ বড়, রিপ্লেস হয়ে যাবে ২ এর সাথে।।
///সুতরাং দাঁড়ায় => ক[১,২,২,৩] এবং খ[২,৩,৪,৫]।। এইভাবে চলতে থাকবে যতোক্ষণ না সমান হচ্ছে।।

#include<bits/stdc++.h>
using namespace std;

int digit(int x) {
    int cnt = 0;   ///এই ফাংশনটি ডিজিট সংখ্যা রিটার্ণ করবে
    while(x!=0) {
        x = x/10;
        cnt++;
    }
    return cnt;
}

int main () {
    int n;
    cin>>n;
    vector<int>a(n);
    vector<int>b(n);
    for(int i=0; i<n; i++) {
        cin>>a[i];
    }
    for(int i=0; i<n; i++) {
        cin>>b[i];
    }
    priority_queue<int>p1;
    priority_queue<int>p2;
    for(int i=0; i<n; i++) {
        p1.push(a[i]);
        p2.push(b[i]);    ///প্রায়োরিটি কিউগুলোতে অ্যারের এলিমেন্টগুলো পুশ করলাম
    }
    int ans = 0; ///অপারেশন কাউন্ট করতে হবে এই ভ্যারিয়েবলে

    while(p1.size()) { ///দুটি অ্যাারের সাইজই সমান তাই একটি নিলেই হচ্ছে
        int x = p1.top();
        int y = p2.top();
        ans++;
        if(x==y) {
            p1.pop(); ///দুটি এলিমেন্টই সমান হলে দুটিই পপ করে দিচ্ছি
            p2.pop();
            continue;
        }
        if(x>y) {
            p1.pop();
            p1.push(digit(x)); ///বড় হলে ডিজিট সংখ্যা পুশ করছি আর ঐ বড়টি পপ করছি।।
        }
        else {
            p2.pop();
            p2.push(digit(y));
        }
    }
    cout<<"অ্যাারে দুটি সমান হতে অপারেশন লাগবে => "<<ans;
    return 0;
}
